tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

brew "docker"
brew "docker-compose"
brew "gh"
brew "git"
brew "mas"
brew "mysql", restart_service: true
brew "sqlite"
brew "python@3.9"
brew "node"
brew "nvm"
brew "redis"
brew "vim"
brew "wget"
brew "yarn"

mas "Magnet", id: 441258766
mas "Slack", id: 803453959
mas "StatusClock", id: 552792489