tap 'caskroom/cask'

# Core Homebrew
brew 'zsh'
brew 'git'
brew 'sqlite3'
brew 'mysql', restart_service: true
brew 'nvm'
brew 'npm'
brew 'yarn'
brew 'vim'
brew 'wget'
brew 'python3'
brew 'python'
brew 'docker'
brew 'heroku'
brew 'mongodb'
brew 'redis'
brew 'mas'

# Cask Apps
cask 'google-chrome'
cask 'visual-studio-code'
cask 'iterm2'
cask 'docker'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'sequel-pro'
cask 'filezilla'
cask 'postman'
cask 'microsoft-teams'
cask 'discord'
cask 'spotify'

# Mac app store
mas 'Xcode', id: 497799835
mas 'GIPHY CAPTURE', id: 668208984
mas 'Amphetamine', id: 937984704
mas 'LastPass', id: 926036361
mas 'Slack', id: 803453959
mas 'Magnet', id: 441258766